; domain
(define (domain zenotravel)
	(:requirements :typing :negative-preconditions)
	(:types
		Time - Object
		City - Object
		Aircraft - Thing
		Person - Thing
		Thing - Object
		FLevel - Object
	)
	(:predicates
		(at ?arg0 - Thing ?arg1 - City)
		(in ?arg0 - Person ?arg1 - Aircraft)
		(next ?arg0 - FLevel ?arg1 - FLevel)
		(max ?arg0 - FLevel)
        (min ?arg0 - FLevel)
        (not-min ?arg0 - FLevel)
		(fuel-level ?arg0 - Aircraft ?arg1 - FLevel)
	)
	(:action board
		:parameters (?p - Person ?a - Aircraft ?c - City)
		:precondition
			(and
				(at ?p ?c)
                (at ?a ?c)
			)
		:effect
			(and
				(not (at ?p ?c))
				(in ?p ?a)
			)
	)

	(:action debark
		:parameters (?p - Person ?a - Aircraft ?c - City)
		:precondition
			(and
				(in ?p ?a)
                (at ?a ?c)
			)
		:effect
			(and
				(not (in ?p ?a))
				(at ?p ?c)
			)
	)

	(:action refuel
		:parameters (?a - Aircraft ?l - FLevel ?l1 - FLevel)
		:precondition
			(and
				(fuel-level ?a ?l)
			)
		:effect
			(and
				(not (fuel-level ?a ?l))
				(fuel-level ?a ?l1)
			)
	)

	(:action fly
		:parameters (?a - Aircraft ?c1 - City ?c2 - City ?l1 - FLevel ?l2 - FLevel)
		:precondition
			(and
				(at ?a ?c1)
				(fuel-level ?a ?l1)
                (next ?l2 ?l1)
			)
		:effect
			(and
				(not (at ?a ?c1))
				(at ?a ?c2)
				(not (fuel-level ?a ?l1))
				(fuel-level ?a ?l2)
			)
	)
)

; problem
(define (problem p18)
(:domain zenotravel)
(:objects
 f0 f1 f2 - FLevel
 a1 a2 a3 - Aircraft
 c1 c2 c3 c4 c5 c6 c7 c8 - City
 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 - Person
)
(:init
(min f0) (max f2)
(next f0 f1)
(not-min f1)
(next f1 f2)
(not-min f2)
(fuel-level a1 f2) (at a1 c1)
(fuel-level a2 f2) (at a2 c2)
(fuel-level a3 f2) (at a3 c7)
(at p1 c1)
(at p2 c1)
(at p3 c5)
(at p4 c8)
(at p5 c2)
(at p6 c6)
(at p7 c1)
(at p8 c3)
(at p9 c8)
(at p10 c4)
(at p11 c8)
(at p12 c5)
(at p13 c7)
(at p14 c4)
(at p15 c4)
(at p16 c3)
(at p17 c4)
(at p18 c8)
(at p19 c2)
)
(:goal (and
(at a1 c1)
(at a2 c2)
(at a3 c7)
(at p1 c3)
(at p2 c6)
(at p3 c1)
(at p4 c8)
(at p5 c4)
(at p6 c1)
(at p7 c8)
(at p8 c3)
(at p9 c7)
(at p10 c3)
(at p11 c2)
(at p12 c3)
(at p13 c3)
(at p14 c3)
(at p15 c6)
(at p16 c2)
(at p17 c2)
(at p18 c2)
(at p19 c2)
))
)

; plan
1. (board p1 a1 c1)
   deleted: (at p1 c1)
   added: (in p1 a1)
   goals met: 6 of 22
2. (fly a1 c1 c3 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c3) (fuel-level a1 f1)
   goals met: 5 of 22
3. (debark p1 a1 c3)
   deleted: (in p1 a1)
   added: (at p1 c3)
   goals met: 6 of 22
4. (fly a1 c3 c1 f1 f0)
   deleted: (at a1 c3) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 7 of 22
5. (board p2 a1 c1)
   deleted: (at p2 c1)
   added: (in p2 a1)
   goals met: 7 of 22
6. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 7 of 22
7. (fly a1 c1 c6 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c6) (fuel-level a1 f1)
   goals met: 6 of 22
8. (debark p2 a1 c6)
   deleted: (in p2 a1)
   added: (at p2 c6)
   goals met: 7 of 22
9. (fly a1 c6 c5 f1 f0)
   deleted: (at a1 c6) (fuel-level a1 f1)
   added: (at a1 c5) (fuel-level a1 f0)
   goals met: 7 of 22
10. (board p3 a1 c5)
   deleted: (at p3 c5)
   added: (in p3 a1)
   goals met: 7 of 22
11. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 7 of 22
12. (fly a1 c5 c1 f2 f1)
   deleted: (at a1 c5) (fuel-level a1 f2)
   added: (at a1 c1) (fuel-level a1 f1)
   goals met: 8 of 22
13. (debark p3 a1 c1)
   deleted: (in p3 a1)
   added: (at p3 c1)
   goals met: 9 of 22
14. (board p5 a2 c2)
   deleted: (at p5 c2)
   added: (in p5 a2)
   goals met: 9 of 22
15. (fly a2 c2 c4 f2 f1)
   deleted: (at a2 c2) (fuel-level a2 f2)
   added: (at a2 c4) (fuel-level a2 f1)
   goals met: 8 of 22
16. (debark p5 a2 c4)
   deleted: (in p5 a2)
   added: (at p5 c4)
   goals met: 9 of 22
17. (fly a1 c1 c6 f1 f0)
   deleted: (at a1 c1) (fuel-level a1 f1)
   added: (at a1 c6) (fuel-level a1 f0)
   goals met: 8 of 22
18. (board p6 a1 c6)
   deleted: (at p6 c6)
   added: (in p6 a1)
   goals met: 8 of 22
19. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 8 of 22
20. (fly a1 c6 c1 f2 f1)
   deleted: (at a1 c6) (fuel-level a1 f2)
   added: (at a1 c1) (fuel-level a1 f1)
   goals met: 9 of 22
21. (debark p6 a1 c1)
   deleted: (in p6 a1)
   added: (at p6 c1)
   goals met: 10 of 22
22. (board p7 a1 c1)
   deleted: (at p7 c1)
   added: (in p7 a1)
   goals met: 10 of 22
23. (fly a1 c1 c8 f1 f0)
   deleted: (at a1 c1) (fuel-level a1 f1)
   added: (at a1 c8) (fuel-level a1 f0)
   goals met: 9 of 22
24. (debark p7 a1 c8)
   deleted: (in p7 a1)
   added: (at p7 c8)
   goals met: 10 of 22
25. (board p9 a1 c8)
   deleted: (at p9 c8)
   added: (in p9 a1)
   goals met: 10 of 22
26. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 10 of 22
27. (fly a1 c8 c7 f2 f1)
   deleted: (at a1 c8) (fuel-level a1 f2)
   added: (at a1 c7) (fuel-level a1 f1)
   goals met: 10 of 22
28. (debark p9 a1 c7)
   deleted: (in p9 a1)
   added: (at p9 c7)
   goals met: 11 of 22
29. (board p10 a2 c4)
   deleted: (at p10 c4)
   added: (in p10 a2)
   goals met: 11 of 22
30. (fly a2 c4 c3 f1 f0)
   deleted: (at a2 c4) (fuel-level a2 f1)
   added: (at a2 c3) (fuel-level a2 f0)
   goals met: 11 of 22
31. (debark p10 a2 c3)
   deleted: (in p10 a2)
   added: (at p10 c3)
   goals met: 12 of 22
32. (fly a1 c7 c8 f1 f0)
   deleted: (at a1 c7) (fuel-level a1 f1)
   added: (at a1 c8) (fuel-level a1 f0)
   goals met: 12 of 22
33. (board p11 a1 c8)
   deleted: (at p11 c8)
   added: (in p11 a1)
   goals met: 12 of 22
34. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 12 of 22
35. (fly a1 c8 c2 f2 f1)
   deleted: (at a1 c8) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 12 of 22
36. (debark p11 a1 c2)
   deleted: (in p11 a1)
   added: (at p11 c2)
   goals met: 13 of 22
37. (fly a1 c2 c5 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c5) (fuel-level a1 f0)
   goals met: 13 of 22
38. (board p12 a1 c5)
   deleted: (at p12 c5)
   added: (in p12 a1)
   goals met: 13 of 22
39. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 13 of 22
40. (fly a1 c5 c3 f2 f1)
   deleted: (at a1 c5) (fuel-level a1 f2)
   added: (at a1 c3) (fuel-level a1 f1)
   goals met: 13 of 22
41. (debark p12 a1 c3)
   deleted: (in p12 a1)
   added: (at p12 c3)
   goals met: 14 of 22
42. (board p13 a3 c7)
   deleted: (at p13 c7)
   added: (in p13 a3)
   goals met: 14 of 22
43. (fly a3 c7 c3 f2 f1)
   deleted: (at a3 c7) (fuel-level a3 f2)
   added: (at a3 c3) (fuel-level a3 f1)
   goals met: 13 of 22
44. (debark p13 a3 c3)
   deleted: (in p13 a3)
   added: (at p13 c3)
   goals met: 14 of 22
45. (fly a1 c3 c4 f1 f0)
   deleted: (at a1 c3) (fuel-level a1 f1)
   added: (at a1 c4) (fuel-level a1 f0)
   goals met: 14 of 22
46. (board p14 a1 c4)
   deleted: (at p14 c4)
   added: (in p14 a1)
   goals met: 14 of 22
47. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 14 of 22
48. (fly a1 c4 c3 f2 f1)
   deleted: (at a1 c4) (fuel-level a1 f2)
   added: (at a1 c3) (fuel-level a1 f1)
   goals met: 14 of 22
49. (debark p14 a1 c3)
   deleted: (in p14 a1)
   added: (at p14 c3)
   goals met: 15 of 22
50. (fly a1 c3 c4 f1 f0)
   deleted: (at a1 c3) (fuel-level a1 f1)
   added: (at a1 c4) (fuel-level a1 f0)
   goals met: 15 of 22
51. (board p15 a1 c4)
   deleted: (at p15 c4)
   added: (in p15 a1)
   goals met: 15 of 22
52. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 15 of 22
53. (fly a1 c4 c6 f2 f1)
   deleted: (at a1 c4) (fuel-level a1 f2)
   added: (at a1 c6) (fuel-level a1 f1)
   goals met: 15 of 22
54. (debark p15 a1 c6)
   deleted: (in p15 a1)
   added: (at p15 c6)
   goals met: 16 of 22
55. (board p16 a2 c3)
   deleted: (at p16 c3)
   added: (in p16 a2)
   goals met: 16 of 22
56. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 16 of 22
57. (fly a2 c3 c2 f2 f1)
   deleted: (at a2 c3) (fuel-level a2 f2)
   added: (at a2 c2) (fuel-level a2 f1)
   goals met: 17 of 22
58. (debark p16 a2 c2)
   deleted: (in p16 a2)
   added: (at p16 c2)
   goals met: 18 of 22
59. (fly a1 c6 c4 f1 f0)
   deleted: (at a1 c6) (fuel-level a1 f1)
   added: (at a1 c4) (fuel-level a1 f0)
   goals met: 18 of 22
60. (board p17 a1 c4)
   deleted: (at p17 c4)
   added: (in p17 a1)
   goals met: 18 of 22
61. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 18 of 22
62. (fly a1 c4 c2 f2 f1)
   deleted: (at a1 c4) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 18 of 22
63. (debark p17 a1 c2)
   deleted: (in p17 a1)
   added: (at p17 c2)
   goals met: 19 of 22
64. (fly a1 c2 c8 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c8) (fuel-level a1 f0)
   goals met: 19 of 22
65. (board p18 a1 c8)
   deleted: (at p18 c8)
   added: (in p18 a1)
   goals met: 19 of 22
66. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 19 of 22
67. (fly a1 c8 c2 f2 f1)
   deleted: (at a1 c8) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 19 of 22
68. (debark p18 a1 c2)
   deleted: (in p18 a1)
   added: (at p18 c2)
   goals met: 20 of 22
69. (fly a1 c2 c1 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 21 of 22
70. (fly a3 c3 c7 f1 f0)
   deleted: (at a3 c3) (fuel-level a3 f1)
   added: (at a3 c7) (fuel-level a3 f0)
   goals met: 22 of 22
